# **Prueba #2**
En la siguiente pureba se evalua de manera EXCLUSIVA lo que se solicita, cualquier otra respuesta adicional a ella será valorada, más no evaluada. Entregue la prueba en un repositorio de github antes de el domingo 18 de Febrero a las 23:59:59.

## **Ejercicio 1** (40%)

Construya un DataFrame a partir del siguiente diccionario

`exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, 10, 9, 20, 14.5, 12, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}`

con las siguientes etiquetas para los índices

`labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']`

1. Seleccione solo las columnas *name* y *score*.
  
2. Filtre las filas donde el número de intentos (attemps) sea mayor que 2.

3. Filtre las filas donde el *score* se encuentre entre 15 y 20 (incluidos)

4. Cambie el *score* en la fila 'd' a 11.5

5. Agregue una nueva fila con etiqueta 'k' al dataframe con un valor que usted desee para cada columna

6. Borre la fila 'k' y entregue nuevamente el DataFrame original.

7. Ordene el DataFrame por nombre en orden ascendente.

8. Reemplace los valores de la columna *qualify* que contiene los valores *yes* y *no* por los valores booleanos True y False respectivamente.

In [2]:
#1. Seleccione solo las columnas name y score.

#Import pandas library to process DataFrames
import pandas as pd

#Prepare data to conver to DataFrame
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, 10, 9, 20, 14.5, 12, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

#Preparte the indexes for the DF
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# Create DataFrame
test_score = pd.DataFrame(data=exam_data, index= labels)

# Indexing columns 'name' and 'score'
test_score[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James   10.0
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura   12.0
i      Kevin    8.0
j      Jonas   19.0

In [3]:
#2. Filtre las filas donde el número de intentos (attemps) sea mayor que 2.

#Create boolean mask to filter the people with aattemps greater than 2 on the test
test_score[test_score.attempts > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James   10.0         3      no
f  Michael   20.0         3     yes

In [4]:
#3.Filtre las filas donde el score se encuentre entre 15 y 20 (incluidos)

# Create a boolean mask to filter the people with a score greater or equal to 15 and less or equal to 20
test_score[(test_score.score >= 15) & (test_score.score <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [5]:
#4.Cambie el score en la fila 'd' a 11.5

#Change the value of the position (d, score) on the DF to 11.5
test_score.loc['d', 'score'] =  11.5
test_score

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   12.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [6]:
#5.Agregue una nueva fila con etiqueta 'k' al dataframe con un valor que usted desee para cada columna

#Add a new row called 'k' with arbitrary values
test_score.loc['k'] = ['Yeferson Nevin Felipe', 14, 1, 'no']
test_score

                    name  score  attempts qualify
a              Anastasia   12.5         1     yes
b                   Dima    9.0         3      no
c              Katherine   16.5         2     yes
d                  James   11.5         3      no
e                  Emily    9.0         2      no
f                Michael   20.0         3     yes
g                Matthew   14.5         1     yes
h                  Laura   12.0         1      no
i                  Kevin    8.0         2      no
j                  Jonas   19.0         1     yes
k  Yeferson Nevin Felipe   14.0         1      no

In [7]:
#6. Borre la fila 'k' y entregue nuevamente el DataFrame original.

#Remove the recently created row with index 'k'
test_score.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   12.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [8]:
#7. Ordene el DataFrame por nombre en orden ascendente.

#Sort the dataframe values based on the column name in an ascendent way
test_score.sort_values(by='name')

                    name  score  attempts qualify
a              Anastasia   12.5         1     yes
b                   Dima    9.0         3      no
e                  Emily    9.0         2      no
d                  James   11.5         3      no
j                  Jonas   19.0         1     yes
c              Katherine   16.5         2     yes
i                  Kevin    8.0         2      no
h                  Laura   12.0         1      no
g                Matthew   14.5         1     yes
f                Michael   20.0         3     yes
k  Yeferson Nevin Felipe   14.0         1      no

In [9]:
#8. Reemplace los valores de la columna qualify que contiene los valores yes y no por los valores booleanos True y False respectivamente.

#Reassign the values of column 'qualify' based on its values 'yes' and 'no' to True and false respectively
test_score['qualify'] = test_score['qualify'].map({"yes":True , "no":False})
test_score

                    name  score  attempts  qualify
a              Anastasia   12.5         1     True
b                   Dima    9.0         3    False
c              Katherine   16.5         2     True
d                  James   11.5         3    False
e                  Emily    9.0         2    False
f                Michael   20.0         3     True
g                Matthew   14.5         1     True
h                  Laura   12.0         1    False
i                  Kevin    8.0         2    False
j                  Jonas   19.0         1     True
k  Yeferson Nevin Felipe   14.0         1    False

## **Ejercicio 2** (30%)

Importe el dataset `athletes` del repositorio del curso y realice las siguientes tareas:

1. Importarlo como nombre athletes
2. Filtre el dataframe tal que solo se quede con los atletas que hayan ganado al menos una medalla.
3. Calcule la masa muscular por fila con una función como

$$I_{m.m.} = \frac{Weight}{Height^2}$$

4. Agrupe los datos por calculando la media por deporte para cada una del resto de características. ¿Cuál es el deporte en el que los jugadores tienen mayor peso promedio?

5. ¿Cuál es el pais con más participación femenina?

In [10]:
#1. Importar el conjunto de datos


# Import the pandas library and alias it as pd
import pandas as pd

# Read the CSV file "athletes" from a URL and assign it to the variable "athletes"
athletes = pd.read_csv("https://raw.githubusercontent.com/tomasate/Datos_Clases/main/Datos_1/athletes.csv")

# Print information about the "athletes" DataFrame including details such as the number of columns,
# the number of non-null entries, and the data types of each column.
athletes.info()

# Display the "athletes" DataFrame
athletes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11538 entries, 0 to 11537
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           11538 non-null  int64
 1   name         11538 non-null  object
 2   nationality  11538 non-null  object
 3   sex          11538 non-null  object
 4   dob          11537 non-null  object
 5   height       11208 non-null  float64
 6   weight       10879 non-null  float64
 7   sport        11538 non-null  object
 8   gold         11538 non-null  int64
 9   silver       11538 non-null  int64
 10  bronze       11538 non-null  int64
dtypes: float64(2), int64(4), object(5)
memory usage: 991.7+ KB

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
11533,265605954,Zurian Hechavarria,CUB,female,8/10/95,1.64,58.0,athletics,0,0,0
11534,214461847,Zuzana Hejnova,CZE,female,12/19/86,1.73,63.0,athletics,0,0,0
11535,88361042,di Xiao,CHN,male,5/14/91,1.85,100.0,wrestling,0,0,0
11536,900065925,le Quoc Toan Tran,VIE,male,4/5/89,1.60,56.0,weightlifting,0,0,0
11537,711404576,le Roux Hamman,RSA,male,1/6/92,1.85,70.0,athletics,0,0,0

In [11]:
# 2. Filtre el dataframe tal que solo se quede con los atletas que hayan ganado al menos una medalla.


# Filter the DataFrame to keep only rows where athletes have won at least one medal
athletes_md_win = athletes[(athletes['gold'] > 0) | (athletes['silver'] > 0) | (athletes['bronze'] > 0)].copy()

# Display the filtered DataFrame containing athletes who have won at least one medal
athletes_md_win

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
6,266237702,Aaron Russell,USA,male,6/4/93,2.05,98.0,volleyball,0,0,1
14,162792594,Abbey Weitzeil,USA,female,12/3/96,1.78,68.0,aquatics,1,1,0
48,962468808,Abdoulrazak Issoufou Alfaga,NIG,male,12/26/94,2.07,98.0,taekwondo,0,1,0
55,969824503,Abdullah Alrashidi,IOA,male,8/21/63,1.83,84.0,shooting,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
11487,334126873,Zhiyong Shi,CHN,male,10/10/93,1.68,69.0,weightlifting,1,0,0
11491,105609876,Zi He,CHN,female,12/10/90,1.60,52.0,aquatics,0,1,0
11503,593183472,Zivko Gocic,SRB,male,8/22/82,1.93,93.0,aquatics,1,0,0
11509,836633838,Zoe Lee,GBR,female,12/15/85,1.76,70.0,rowing,0,1,0
11511,343671816,Zoe de Toledo,GBR,female,7/17/87,1.72,58.0,rowing,0,1,0

In [12]:
#3. Calcule la masa muscular por fila con una función como


# Assuming weight is in kilograms (kg) and height is in meters (m)
# Define a function to calculate the muscle mass index for each athlete
def calculate_muscle_mass(row):
    return row['weight'] / (row['height'] ** 2)

#Apply the calculate_muscle_mass function to each row of the DataFrame to calculate the muscle mass index,
#and assign the result to a new column named 'muscle_mass_index'

athletes_md_win['muscle_mass_index'] = athletes_md_win.apply(calculate_muscle_mass, axis=1)

# Display the DataFrame with the calculated muscle mass index
athletes_md_win

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze,muscle_mass_index
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1,20.151005
6,266237702,Aaron Russell,USA,male,6/4/93,2.05,98.0,volleyball,0,0,1,23.319453
14,162792594,Abbey Weitzeil,USA,female,12/3/96,1.78,68.0,aquatics,1,1,0,21.461937
48,962468808,Abdoulrazak Issoufou Alfaga,NIG,male,12/26/94,2.07,98.0,taekwondo,0,1,0,22.871012
55,969824503,Abdullah Alrashidi,IOA,male,8/21/63,1.83,84.0,shooting,0,0,1,25.082863
...,...,...,...,...,...,...,...,...,...,...,...,...
11487,334126873,Zhiyong Shi,CHN,male,10/10/93,1.68,69.0,weightlifting,1,0,0,24.447279
11491,105609876,Zi He,CHN,female,12/10/90,1.60,52.0,aquatics,0,1,0,20.312500
11503,593183472,Zivko Gocic,SRB,male,8/22/82,1.93,93.0,aquatics,1,0,0,24.967113
11509,836633838,Zoe Lee,GBR,female,12/15/85,1.76,70.0,rowing,0,1,0,22.598140
11511,343671816,Zoe de Toledo,GBR,female,7/17/87,1.72,58.0,rowing,0,1,0,19.605192

In [13]:
#4. grupe los datos por calculando la media por deporte para cada una del resto de características. ¿Cuál es el deporte en el que los jugadores tienen mayor peso promedio?


# Calculate the mean weight for each sport, sort the results in descending order, and reset the index
weight_mean = athletes_md_win.groupby('sport')['weight'].agg('mean').sort_values(ascending=False).reset_index().rename(columns={"weight": "weight_mean"})

# Print the sport with the highest average weight
print('El deporte con el mayor peso promedio es: {0} con {1:.3g} kg'.format(weight_mean.loc[0, 'sport'], weight_mean.loc[0, 'weight_mean']))

El deporte con el mayor peso promedio es: basketball con 87.5 kg

In [14]:
#5. ¿Cuál es el pais con más participación femenina?


# Filter the DataFrame to keep only rows where the athlete's sex is 'female',
# group the results by nationality, count the number of entries for each nationality,
# and sort the counts in descending order.
female_participation = athletes_md_win[athletes_md_win['sex'] == 'female'].groupby('nationality').agg('count')['id'].sort_values(ascending=False)

# Print the country with the highest female participation
print('El país con la mayor participación femenina fue {0} con {1} participantes'.format(female_participation.idxmax(), female_participation[female_participation.idxmax()]))

El país con la mayor participación femenina fue USA con 117 participantes

## **Ejercicio 3 (30%)**

Importe el dataset de nba del repositorio de clase y responda (hint: Elimine las instancias con registros faltantes):

1. Cuáles son los equipos que pagan los salarios más altos (presente el resultado como un dataFrame con el nombre del equipo y la cantidad de dinero de la nómina)
2. Separe la variable *Age* en tres grupos y cree una nueva columna llamada *Age-Group* con esta información.<
3. Construya una tabla dinámica que muestre el salario promedio de los jugadores por equipo y posición para para los cinco equipos que pagan mejores salarios.

In [15]:
import pandas as pd

#Import the data from GitHub to a DataFrame object
nba_data = pd.read_csv("https://raw.githubusercontent.com/tomasate/Datos_Clases/main/Datos_1/nba.csv", index_col=0).drop(['College'], axis = 1).dropna()

#Check the data for an initial approach
print(nba_data.info())
nba_data

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 0 to 456
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      446 non-null    object
 1   Team      446 non-null    object
 2   Number    446 non-null    float64
 3   Position  446 non-null    object
 4   Age       446 non-null    float64
 5   Height    446 non-null    object
 6   Weight    446 non-null    float64
 7   Salary    446 non-null    float64
dtypes: float64(4), object(4)
memory usage: 31.4+ KB
None

,Name,Team,Number,Position,Age,Height,Weight,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,12000000.0
...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,947276.0

In [16]:
#1. Cuáles son los equipos que pagan los salarios más altos (presente el resultado como un dataFrame con el nombre del equipo y la cantidad de dinero de la nómina)

# Group the data by 'Team', and then aggregate them with the 'sum' function to get the total salary expenses by Team, then sort the values in a descending way and as a last step, reset the index to get a DataFrame instead of a Series object
salary_by_team = nba_data.groupby('Team')['Salary'].agg('sum').sort_values(ascending=False).reset_index()

#Change the name of the columns to represent the salary expenses invested by each team
salary_by_team.columns = ['Team', 'Salary_Expenses']
salary_by_team

                      Team  Salary_Expenses
0      Cleveland Cavaliers      106988689.0
1     Los Angeles Clippers       94854640.0
2    Oklahoma City Thunder       93765298.0
3    Golden State Warriors       88868997.0
4            Chicago Bulls       86783378.0
5        San Antonio Spurs       84442733.0
6     New Orleans Pelicans       82750774.0
7               Miami Heat       82515673.0
8        Charlotte Hornets       78340920.0
9        Memphis Grizzlies       76550880.0
10      Washington Wizards       76328636.0
11         Houston Rockets       75283021.0
12         New York Knicks       73303898.0
13           Atlanta Hawks       72902950.0
14      Los Angeles Lakers       71770431.0
15        Sacramento Kings       71683666.0
16        Dallas Mavericks       71198732.0
17         Toronto Raptors       71117611.0
18         Milwaukee Bucks       69603517.0
19         Detroit Pistons       67168263.0
20          Indiana Pacers       66751826.0
21            Phoenix Suns       63445135.0
22               Utah Jazz       63060091.0
23           Orlando Magic       60161470.0
24          Denver Nuggets       60121930.0
25  Minnesota Timberwolves       59709697.0
26          Boston Celtics       58541068.0
27           Brooklyn Nets       52528475.0
28  Portland Trail Blazers       48301818.0
29      Philadelphia 76ers       30992894.0

In [17]:
#2. Separe la variable Age en tres grupos y cree una nueva columna llamada Age-Group con esta información

# Create a new column 'Age-Group' where the players are divided into three groups based in their age like this: from (0, 24] = 'Prospects', (24, 30] = Prime_Player', (30, 41] = 'Veterans'
nba_data['Age-Group'] = pd.cut(nba_data.Age, bins = [0, 24, 32, 41], labels = ['Prospects', 'Prime_Player', 'Veterans'])
nba_data

,Name,Team,Number,Position,Age,Height,Weight,Salary,Age-Group
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,7730337.0,Prime_Player
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,6796117.0,Prime_Player
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,1148640.0,Prospects
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,5000000.0,Prime_Player
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,12000000.0,Prime_Player
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,2239800.0,Prospects
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,2433333.0,Prime_Player
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,900000.0,Prospects
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,2900000.0,Prime_Player
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,947276.0,Prime_Player

In [18]:
#3.Construya una tabla dinámica que muestre el salario promedio de los jugadores por equipo y posición para para los cinco equipos que pagan mejores salarios.

#Get a dynamic table based on the top five teams with higher salary expenses, to show the salary mean, based on the player's position and Team
elite_teams = nba_data[nba_data.Team.isin(salary_by_team.loc[:4,'Team'])].pivot_table('Salary', index = 'Position', columns = 'Team')
elite_teams

Team,Chicago Bulls,Cleveland Cavaliers,Golden State Warriors,Los Angeles Clippers,Oklahoma City Thunder
Position,,,,,
C,10424380.00,6.828957e+06,6.541249e+06,1.039480e+07,6.303143e+06
PF,3361007.40,1.394101e+07,7.275312e+06,6.655482e+06,5.821013e+06
PG,11171532.00,6.551592e+06,8.457256e+06,8.509072e+06,9.382869e+06
SF,1958160.00,1.195889e+07,3.766367e+06,3.662924e+06,8.599621e+06
SG,5717549.25,3.761809e+06,6.316092e+06,4.639893e+06,3.207058e+06